{
  "id": "the-last-sakura",
  "title": "The Last Sakura",
  "author": "Yuki Tanaka",
  "genre": "Romance",
  "readTime": 5,
  "chapters": [
    {
      "id": "chapter1",
      "title": "The Ancient Tree",
      "content": "<p>Under the gentle embrace of spring's first warmth, the ancient sakura tree in Hikarimachi Park bloomed for what would be its final season. Every petal that fell carried with it a memory, a whisper of love that had once flourished beneath its branches.</p><p>Akira stood beneath the tree, his weathered hands tracing the bark that had witnessed his entire life. Fifty years ago, on this very spot, he had first met Hana. She had been sketching the tree in her notebook, her dark hair catching the golden afternoon light like spun silk.</p><p>\"Beautiful, isn't it?\" she had said, not looking up from her drawing. \"They say this tree is over 200 years old. Imagine all the love stories it has seen.\"</p><p>He had been too nervous to speak properly, managing only a nod. But she had smiled at him then, a smile that would become his anchor through decades of storms.</p>"
    },
    {
      "id": "chapter2",
      "title": "A Lifetime of Memories",
      "content": "<p>Every spring, they returned to this tree. Through university exams, through his first job, through their wedding, through the birth of their daughter Yuki, through every joy and sorrow that life could offer. The tree became their constant, their witness, their keeper of secrets.</p><p>Last year, Hana had been too weak to make the journey. The cancer that had started in her lungs had spread like winter frost, stealing her breath and her strength. But she had made him promise: \"Bring me one last blossom, Akira. Just one.\"</p><p>He had broken that promise. She had slipped away during the night, three days before the first buds opened. Now, as the final petals drifted down around him like pink snow, he understood. She hadn't wanted the blossom for herself. She had wanted him to have this moment, this final gift of beauty to carry him through the years ahead.</p>"
    },
    {
      "id": "chapter3",
      "title": "A Final Promise",
      "content": "<p>A soft breeze stirred the branches, and a single perfect petal landed on his palm. It was the color of her favorite lipstick, the shade she had worn on their first date. He closed his fingers around it gently, feeling the weight of every spring they had shared.</p><p>\"Thank you,\" he whispered to the tree, to the sky, to the memory of her laughter. \"For everything.\"</p><p>As the sun set behind the mountains, painting the sky in shades of rose and gold, Akira made his way home. In his pocket, the petal remained, a small pink promise that love, like the sakura, returns in its own perfect time.</p>"
    }
  ]
}